In [2]:
import pandas as pd
import numpy  as np
import matplotlib.pyplot as plt

In [3]:
teams_df = pd.read_csv(".\Teams.csv")
playoffs_df = pd.read_csv(".\PlayoffTeams.csv")
salaries_df = pd.read_csv(".\Salaries.csv")
franchises_df = pd.read_csv(".\TeamsFranchises.csv")
teams_df.head()
teams_df.count

<bound method DataFrame.count of       yearID lgID teamID franchID divID  Rank    G  Ghome   W   L  ...     DP  \
0       1871  NaN    BS1      BNA   NaN     3   31    NaN  20  10  ...    NaN
1       1871  NaN    CH1      CNA   NaN     2   28    NaN  19   9  ...    NaN
2       1871  NaN    CL1      CFC   NaN     8   29    NaN  10  19  ...    NaN
3       1871  NaN    FW1      KEK   NaN     7   19    NaN   7  12  ...    NaN
4       1871  NaN    NY2      NNA   NaN     5   33    NaN  16  17  ...    NaN
...      ...  ...    ...      ...   ...   ...  ...    ...  ..  ..  ...    ...
2800    2015   NL    LAN      LAD     W     1  162   81.0  92  70  ...  133.0
2801    2015   NL    SFN      SFG     W     2  162   81.0  84  78  ...  145.0
2802    2015   NL    ARI      ARI     W     3  162   81.0  79  83  ...  146.0
2803    2015   NL    SDN      SDP     W     4  162   81.0  74  88  ...  138.0
2804    2015   NL    COL      COL     W     5  162   81.0  68  94  ...  171.0

         FP                     name                          park  \
0     0.830     Boston Red Stockings           South End Grounds I
1     0.820  Chicago White Stockings       Union Base-Ball Grounds
2     0.810   Cleveland Forest Citys  National Association Grounds
3     0.800     Fort Wayne Kekiongas                Hamilton Field
4     0.830         New York Mutuals      Union Grounds (Brooklyn)
...     ...                      ...                           ...
2800  0.988      Los Angeles Dodgers                Dodger Stadium
2801  0.987     San Francisco Giants                     AT&T Park
2802  0.986     Arizona Diamondbacks                   Chase Field
2803  0.985         San Diego Padres                    Petco Park
2804  0.985         Colorado Rockies                   Coors Field

      attendance  BPF  PPF  teamIDBR  teamIDlahman45  teamIDretro
0            NaN  103   98       BOS             BS1          BS1
1            NaN  104  102       CHI             CH1          CH1
2            NaN   96  100       CLE             CL1          CL1
3            NaN  101  107       KEK             FW1          FW1
4            NaN   90   88       NYU             NY2          NY2
...          ...  ...  ...       ...             ...          ...
2800   3764815.0  101   98       LAD             LAN          LAN
2801   3375882.0   99   97       SFG             SFN          SFN
2802   2080145.0  107  106       ARI             ARI          ARI
2803   2459742.0   98   97       SDP             SDN          SDN
2804   2506789.0  119  118       COL             COL          COL

[2805 rows x 48 columns]>

In [4]:
# clean up Teams dataframes to chosen years (2005-2015)

teams_df = teams_df.loc[teams_df['yearID'] > 2004]
teams_df.count
playoffs_df = playoffs_df.loc[playoffs_df['yearID'] > 2004]
playoffs_df.count

<bound method DataFrame.count of      yearID  round teamIDwinner lgIDwinner teamIDloser lgIDloser  wins  \
222    2005   ALCS          CHA         AL         LAA        AL     4
223    2005  ALDS1          CHA         AL         BOS        AL     3
224    2005  ALDS2          LAA         AL         NYA        AL     3
225    2005   NLCS          HOU         NL         SLN        NL     4
226    2005  NLDS1          SLN         NL         SDN        NL     3
..      ...    ...          ...        ...         ...       ...   ...
302    2015   NLWC          CHN         NL         PIT        NL     1
303    2015   NLCS          NYN         NL         CHN        NL     4
304    2015  NLDS1          CHN         NL         SLN        NL     3
305    2015  NLDS2          NYN         NL         LAN        NL     3
306    2015     WS          KCA         AL         NYN        NL     4

     losses  ties
222       1     0
223       0     0
224       2     0
225       2     0
226       0     0
..      ...   ...
302       0     0
303       0     0
304       1     0
305       2     0
306       1     0

[85 rows x 9 columns]>

In [5]:
# plot_df = cleaned_df[['Drug Regimen', 'Mouse ID']].drop_duplicates().groupby('Drug Regimen').count()

winners_df = playoffs_df[['teamIDwinner']].drop_duplicates()
winners_df.head()
winners_df.count()
#losers_df
losers_df = playoffs_df[['teamIDloser']].drop_duplicates()
losers_df.head()
losers_df.count()

print(winners_df)
print(losers_df)

    teamIDwinner
222          CHA
224          LAA
225          HOU
226          SLN
229          DET
231          OAK
233          NYN
236          BOS
238          CLE
239          COL
240          ARI
243          TBA
246          PHI
247          LAN
250          NYA
257          TEX
260          SFN
269          MIL
271          BAL
284          PIT
289          KCA
301          TOR
302          CHN
    teamIDloser
222         LAA
223         BOS
224         NYA
225         SLN
226         SDN
227         ATL
228         HOU
229         OAK
231         MIN
232         NYN
233         LAN
235         DET
236         CLE
239         ARI
240         CHN
241         PHI
242         COL
245         CHA
248         MIL
249         TBA
261         CIN
263         TEX
273         BAL
277         WAS
286         PIT
297         KCA
299         TOR

In [16]:
playoff_count_df = playoffs_df['teamIDwinner'].append(playoffs_df['teamIDloser'])
playoff_count_df = playoff_count_df.value_counts()
playoff_count_df
#len(playoff_count_df)

SLN    18
NYA    12
DET    11
BOS    10
SFN    10
PHI    10
LAN     9
TEX     8
KCA     7
LAA     7
TBA     7
HOU     5
OAK     5
CHN     5
NYN     5
COL     4
BAL     4
PIT     4
CHA     4
ATL     4
MIL     3
ARI     3
CLE     3
MIN     3
CIN     3
SDN     2
WAS     2
TOR     2
dtype: int64

In [6]:
#Salaries csv 
salaries_df = pd.read_csv("./Salaries.csv")
salaries_df.head()
salaries_df.count

<bound method DataFrame.count of        yearID teamID lgID   playerID    salary
0        1985    ATL   NL  barkele01    870000
1        1985    ATL   NL  bedrost01    550000
2        1985    ATL   NL  benedbr01    545000
3        1985    ATL   NL   campri01    633333
4        1985    ATL   NL  ceronri01    625000
...       ...    ...  ...        ...       ...
25570    2015    WAS   NL  treinbl01    512800
25571    2015    WAS   NL  ugglada01    507500
25572    2015    WAS   NL  werthja01  21000000
25573    2015    WAS   NL  zimmejo02  16500000
25574    2015    WAS   NL  zimmery01  14000000

[25575 rows x 5 columns]>

In [7]:
#select years 2005-2015
salaries_yr = salaries_df.loc[salaries_df['yearID'] > 2004]
salaries_yr.count
salaries_yr.head()

       yearID teamID lgID   playerID  salary
16463    2005    ARI   NL  aquingr01  325000
16464    2005    ARI   NL  brunebr01  322500
16465    2005    ARI   NL  choatra01  550000
16466    2005    ARI   NL  cintral01  360000
16467    2005    ARI   NL  clarkto02  750000

In [62]:
#Find top salaries - using df with years 2005-2015 and selecting for playoff teams

#salaries_yr.describe()
salaries_yr_df = salaries_yr.loc[salaries_yr['teamID'].isin(playoff_count_df.index)]
salaries_yr_df
#salaries_yr_df["rank"] = salaries_yr_df["salary"].rank(ascending = False)

       yearID teamID lgID   playerID    salary
16463    2005    ARI   NL  aquingr01    325000
16464    2005    ARI   NL  brunebr01    322500
16465    2005    ARI   NL  choatra01    550000
16466    2005    ARI   NL  cintral01    360000
16467    2005    ARI   NL  clarkto02    750000
...       ...    ...  ...        ...       ...
25570    2015    WAS   NL  treinbl01    512800
25571    2015    WAS   NL  ugglada01    507500
25572    2015    WAS   NL  werthja01  21000000
25573    2015    WAS   NL  zimmejo02  16500000
25574    2015    WAS   NL  zimmery01  14000000

[8512 rows x 5 columns]

In [44]:
salaries_describe = salaries_yr_df.describe()
salaries_describe['Sum'] = salaries_test_df.sum()
salaries_describe

              salary                                                  \
               count          mean           std       min       25%
yearID teamID
2005   ARI      27.0  2.308488e+06  3.427508e+06  317500.0  323750.0
       ATL      25.0  3.458292e+06  4.821131e+06  300000.0  450000.0
       BAL      28.0  2.639798e+06  3.889281e+06  316000.0  361250.0
       BOS      28.0  4.410897e+06  4.837406e+06  316000.0  825000.0
       CHA      27.0  2.784370e+06  2.740304e+06  318000.0  600000.0
...              ...           ...           ...       ...       ...
2015   SLN      26.0  4.586212e+06  5.801085e+06  507500.0  524000.0
       TBA      29.0  2.224870e+06  2.696028e+06  507500.0  513800.0
       TEX      30.0  4.791426e+06  6.984724e+06  507000.0  514137.5
       TOR      25.0  4.519696e+06  6.269735e+06  508500.0  517300.0
       WAS      29.0  5.365085e+06  5.965111e+06  507500.0  525000.0

                                                       Sum
                     50%        75%         max
yearID teamID
2005   ARI      550000.0  1925000.0  11000000.0   62329166
       ATL     1000000.0  4250000.0  16061802.0   86457302
       BAL      962500.0  2600000.0  17000000.0   73914333
       BOS     2875000.0  6750000.0  22000000.0  123505125
       CHA     2000000.0  3750000.0   8750000.0   75178000
...                  ...        ...         ...        ...
2015   SLN     2000000.0  6281250.0  19500000.0  119241500
       TBA     1021800.0  3025000.0  11000000.0   64521233
       TEX      937500.0  4593750.0  24000000.0  143742789
       TOR     1021600.0  5000000.0  22000000.0  112992400
       WAS     2500000.0  9000000.0  21000000.0  155587472

[308 rows x 9 columns]

In [39]:
#MONEY SECTION
#How much is a team that got to the playoffs between 2005-2015 spending #per year
# #What is the average per team per general player per    
# Create 2 dataframes answering 2 objectives:
# salaries_describe['Sum'] - How much is a play offs team spends total per year 
# salaries_describe['mean'] - How much the playoff team spends per general player per year
# Find the teams that spend Too Much - top 10% (?) - 3
# Make Bar graph for 1 and 2

# salaries_test_df = salaries_df.loc[salaries_df['teamID'].isin(playoff_count_df.index)]

# salaries_test_df = salaries_test_df.groupby(['yearID', 'teamID'])
# salaries_describe = salaries_test_df.describe()
# salaries_describe['Sum'] = salaries_test_df.sum()
#top_total_spenders = 
#top average_spenders

SyntaxError: invalid syntax (<ipython-input-39-d006b0b6b511>, line 15)

In [63]:
salaries_yr = salaries_yr["salary"]
    
quartiles = salaries_yr.quantile([.25,.5,.75])
lowerq = quartiles[0.25]
upperq = quartiles[0.75]
iqr = upperq-lowerq
print(f"The lower quartile of salary is: {lowerq}")
print(f"The upper quartile of salary is: {upperq}")
print(f"The interquartile range of salary is: {iqr}")
print(f"The median of salary is: {quartiles[0.5]} ")

lower_bound = lowerq - (1.5*iqr)
upper_bound = upperq + (1.5*iqr)
print(f"Values below {lower_bound} could be outliers.")
print(f"Values above {upper_bound} could be outliers.")

The lower quartile of salary is: 482000.0
The upper quartile of salary is: 4427500.0
The interquartile range of salary is: 3945500.0
The median of salary is: 1100000.0
Values below -5436250.0 could be outliers.
Values above 10345750.0 could be outliers.